AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Затраты</Name>
			<Comment>Затраты на единицу номенклатуры партии</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма затрат на единицу товара (дельта цены)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Comment>Сумма затрат на единицу товара (дельта цены) в USD</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Зарегистрировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПартии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ЦенаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупкиВБазВалюте</Name>
					<Comment>в долларах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПроведениеДокументов/Ext/Module.bsl
//
//
Процедура ПроверитьЗаполнениеРеквизитов(ДокументОбъект, РеквизитыСтрокой, Отказ) Экспорт
	
	ТекстСообщения = "";
	мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыСтрокой);		
	Для каждого ИмяРеквизита Из мас Цикл
		Если НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизита]) Тогда 
			Отказ = Истина;
			ТекстСообщения = ТекстСообщения + ДокументОбъект.Метаданные().Реквизиты[ИмяРеквизита].Синоним + ", ";
		КонецЕсли;
	КонецЦикла;
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения)-2);
		ТекстСообщения = СтрШаблон("%1: %2 !)",
									НСтр("ru = 'Не заполнен(ы) реквизит(ы)'; en = 'Details are missing'"),
									ТекстСообщения);
		Сообщить(ТекстСообщения);
	КонецЕсли;             
	
КонецПроцедуры   

// Процедура формирует по переданной структуре полей запрос по табличной части документа.
//
// Параметры: 
//  ДокументОбъект        - объект проводимого документа, 
//  ИмяТабличнойЧасти     - имя табличной части,
//  СтруктураПолей        - структура, ключ структуры содержит псевдоним поля запроса, значение - строку запроса,
//  СтруктураСложныхПолей - структура, ключ структуры содержит псевдоним поля запроса, значение - строку запроса,
//                          необязательный параметр, служит для передачи конструкций типа "ВЫБОР" и т.д.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоТабличнойЧасти (ДокументОбъект, ИмяТабличнойЧасти, 
											СтруктураПолей, СтруктураСложныхПолей = Неопределено) Экспорт
	ТекстЗапроса = "";
	Для Каждого Реквизит Из СтруктураПолей Цикл
		ТекстЗапроса  = ТекстЗапроса + ",
		|Док." + Реквизит.Значение + " КАК " + СокрЛП(Реквизит.Ключ);
	КонецЦикла;
	
	Если ТипЗнч(СтруктураСложныхПолей) = Тип("Структура") Тогда
		Для Каждого Элемент Из СтруктураСложныхПолей Цикл
			ТекстЗапроса  = ТекстЗапроса + ",
			| " + Элемент.Значение + " КАК " + СокрЛП(Элемент.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	| Док.НомерСтроки " + ТекстЗапроса + "
	| ИЗ 
	|      Документ." + МетаданныеДокумента.Имя + "."+ СокрЛП(ИмяТабличнойЧасти) + 
	" КАК Док 
	|     ГДЕ Док.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка" , ДокументОбъект.Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоТабличнойЧасти()

//
//
Функция ПолучитьТаблицуИзТабличнойЧасти() Экспорт

	

КонецФункции // ПолучитьТаблицуИзТабличнойЧасти()

Процедура ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки) Экспорт

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТовары);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.ТипНоменклатуры КАК ТипНоменклатуры
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.ТипНоменклатуры КАК ТипНоменклатуры
	               |ИЗ
	               |	ВТ КАК ВТ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Строка %1: номенклатура %2 с видом %3!'; en = 'Line %1: good %2 has kind %3!'"), 
						Выборка.НомерСтрокиТЧ, Выборка.Номенклатура, Выборка.ТипНоменклатуры));
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьНаОстаткиТоваров(ТаблицаТовары, Дата, Склад, Ошибки, Фирма = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТовары);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Фирма", ?(Фирма = Неопределено, ПараметрыСеанса.Фирма, Фирма));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.Партия КАК Партия,
	               |	ТЗ.Серия КАК Серия,
	               |	ТЗ.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.Партия КАК Партия,
	               |	ВТ.Серия КАК Серия,
	               |	ВТ.Количество КАК Количество,
	               |	ЕСТЬNULL(ОстаткиПартий.ОстатокОстаток, 0) КАК Остаток
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
	               |				&Дата,
	               |				Партия В
	               |						(ВЫБРАТЬ
	               |							Т.Партия
	               |						ИЗ
	               |							ВТ КАК Т)
	               |					И Склад = &Склад
	               |					И Фирма = &Фирма) КАК ОстаткиПартий
	               |		ПО ВТ.Партия = ОстаткиПартий.Партия
	               |ГДЕ
	               |	ВТ.Количество > ЕСТЬNULL(ОстаткиПартий.ОстатокОстаток, 0)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ошибки.Добавить(стршаблон("строка %1: требуется %2, в наличии %3",
						Выборка.НомерСтрокиТЧ,
						Выборка.Количество,
						Выборка.Остаток));
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьДубли(ТЧ, Ошибки, ИмяПоля = "Серия") Экспорт

	СооствОшибки = Новый Соответствие;
	Для каждого СтрокаТЧ Из ТЧ Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ[ИмяПоля]) Тогда
			НайдСтроки = ТЧ.НайтиСтроки(Новый Структура(ИмяПоля, СтрокаТЧ[ИмяПоля]));
			Если НайдСтроки.ВГраница() > 0 Тогда  
				Стр = "";
				Для Инд = 0 По НайдСтроки.ВГраница() Цикл
					Стр = Стр + НайдСтроки[Инд].НомерСтроки + ", ";
				КонецЦикла;
				СооствОшибки.Вставить(СтрокаТЧ[ИмяПоля], Стр);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Если СооствОшибки.Количество() > 0 Тогда
		ТекстОшибки = + Символы.ПС;
		Для каждого Ош Из СооствОшибки Цикл 
			Ошибки.Добавить(СтрШаблон("%1 %2 %3: %4",
									  НСтр("ru = 'Найдены дубли серии'; en = 'Series'"),
									  Ош.Ключ,  
									  НСтр("ru = 'в строках'; en = 'duplicates found in the lines'"),
									  Лев(Ош.Значение, СтрДлина(Ош.Значение)-2)));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


// Возвращает структуру с суммами затрат одной партии, или массиваа партий
//
//  Параметры: 
//    МассивПартийИлиПартия - Массив|СправочникСсылка.Партии, партия
//
Функция ЗатратыПартий(МассивПартийИлиПартия) Экспорт
	
	ОднаПартия = ТипЗнч(МассивПартийИлиПартия) = Тип("СправочникСсылка.Партии");
	МассивПартий = Новый Массив;
	Если ОднаПартия Тогда
		МассивПартий.Добавить(МассивПартийИлиПартия);
	Иначе
	    МассивПартий = МассивПартийИлиПартия;
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Партии", МассивПартий);
	Запр.Текст = "ВЫБРАТЬ
	             |	Затраты.Партия КАК Партия,
	             |	СУММА(Затраты.Сумма) КАК Сумма
	             |ИЗ
	             |	РегистрСведений.Затраты КАК Затраты
	             |ГДЕ
	             |	Затраты.Партия В(&Партии)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Затраты.Партия
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Свод.Партия КАК Партия,
	             |	СУММА(Свод.Сумма) КАК Сумма
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		Партии.Ссылка КАК Партия,
	             |		Партии.Владелец КАК Номенклатура,
	             |		Партии.Док.ВКД_Инвойс КАК Инвойс,
	             |		Партии.Док.Поставка КАК Поставка,
	             |		ЗатратыИнв.Сумма КАК Сумма
	             |	ИЗ
	             |		Справочник.Партии КАК Партии
	             |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |				Затраты.Сумма КАК Сумма,
	             |				Затраты.Номенклатура КАК Номенклатура,
	             |				Затраты.Инвойс КАК Инвойс,
	             |				Затраты.Поставка КАК Поставка
	             |			ИЗ
	             |				РегистрСведений.Затраты КАК Затраты
	             |			ГДЕ
	             |				(Затраты.Номенклатура, Затраты.Инвойс, Затраты.Поставка, Затраты.Партия) В
	             |						(ВЫБРАТЬ
	             |							П.Владелец,
	             |							П.Док.ВКД_Инвойс,
	             |							П.Док.Поставка,
	             |							ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	             |						ИЗ
	             |							Справочник.Партии КАК П
	             |						ГДЕ
	             |							П.Ссылка В (&Партии))) КАК ЗатратыИнв
	             |			ПО Партии.Владелец = ЗатратыИнв.Номенклатура
	             |				И Партии.Док.ВКД_Инвойс = ЗатратыИнв.Инвойс
	             |				И Партии.Док.Поставка = ЗатратыИнв.Поставка
	             |	ГДЕ
	             |		Партии.Ссылка В(&Партии)) КАК Свод
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Свод.Партия";
	Пакет = Запр.ВыполнитьПакет();
	ВыборкаПартии = Пакет[0].Выбрать();
	ВыборкаПартииИнв = Пакет[1].Выбрать(); 

	Если ОднаПартия Тогда
		
		Результат = Новый Структура("ЗатратыПартии, ЗатратыПартииИнвойсов", 0, 0);
		Пока ВыборкаПартии.Следующий() Цикл
			Результат.Вставить("ЗатратыПартии", ВыборкаПартии.Сумма);		
		КонецЦикла;
		Пока ВыборкаПартииИнв.Следующий() Цикл
			Результат.Вставить("ЗатратыПартииИнвойсов", ВыборкаПартииИнв.Сумма);		
		КонецЦикла;
		Возврат Результат;
		
	Иначе
		
		СоотвЗатратыПартии = Новый Соответствие;
		Пока ВыборкаПартии.Следующий() Цикл
			СоотвЗатратыПартии.Вставить(ВыборкаПартии.Партия, ВыборкаПартии.Сумма);		
		КонецЦикла;
		СоотвПартииИнв = Новый Соответствие;
		Пока ВыборкаПартииИнв.Следующий() Цикл
			СоотвПартииИнв.Вставить(ВыборкаПартииИнв.Партия, ВыборкаПартииИнв.Сумма);		
		КонецЦикла;
		Возврат Новый Структура("ЗатратыПартии, ЗатратыПартииИнвойсов", СоотвЗатратыПартии, СоотвПартииИнв);
		
	КонецЕсли;
	
КонецФункции 

// Выводит сообщение об ошибке с возможностью открыть документ кликом на сообщении
//
Процедура СообщитьОбОшибке(ТекстОшибки, ДокументСсылка, Ошибка) Экспорт
	
	Ошибка = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстОшибки;
	Сообщение.КлючДанных = ДокументСсылка;
	Сообщение.Сообщить();

КонецПроцедуры
